app/controllers/login_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
---
  def user_activation
    @user = User.find_by_id(params[:id])