app/controllers/users_controller.rb

INSERT INTO `users` (`account_id`, `created_at`, `email`, `is_activated`, `mobile`, `name`, `otp_secret_key`, `password`, `password_confirmation`, `password_digest`, `updated_at`, `wallet_amount`) VALUES (8512, '2015-03-08 05:22:42', 'nisha@freshdesk.com', 0, 9566959699, 'nish', 'mirywwa3sj4sodzk', NULL, NULL, '$2a$10$9uW5o6A4Wi61bbnqPE8Jn.QXYfAOqLSCNuw0AXfjMspcJvUTnmRry', '2015-03-08 05:22:42', NULL)
---
  def create
    params[:user][:account_id] = Random.rand(1000...9999)
    @user = User.create(params[:user])